reddit_clone/app/views/posts/edit.html.erb

SELECT "subs".* FROM "subs"
SELECT "subs"."id" FROM "subs" INNER JOIN "taggings" ON "subs"."id" = "taggings"."sub_id" WHERE "taggings"."post_id" = $1  [["post_id", 1]]
---

    <% Sub.all.each do |sub| %>
        <h3><%= sub.title %></h3>
        <input type="checkbox" name="post[sub_ids][]" value="<%= sub.id %>" <%= "checked" if  @post.sub_ids.include?(sub.id) %> >