reddit_clone/app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "AT6Qe9qdH_VN_I_WdPiE5Q"], ["updated_at", "2019-05-07 18:19:57.364788"], ["id", 3]]
---
    def reset_token!
        self.session_token = User.generate_token
        self.save!