reddit_clone/app/controllers/posts_controller.rb

    def create
        @post = Post.new(post_params)
        @post.user_id = current_user.id
        if @post.save
---
INSERT INTO "posts" ("title", "url", "content", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "teen titan show cats"], ["url", "teentitan.com"], ["content", "mini me"], ["user_id", 4]]