reddit_clone/app/controllers/subs_controller.rb

    def create
        @sub = current_user.subs.new(sub_params)
        if @sub.save
---
INSERT INTO "subs" ("title", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Teen Titans"], ["description", "bffs with robo cop"], ["user_id", 3], ["created_at", "2019-05-07 18:25:39.684160"], ["updated_at", "2019-05-07 18:25:39.684160"]]